#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяКоманды = "Заполнить";
	КомандаЗаполнения = Команды.Добавить(ИмяКоманды);
	КомандаЗаполнения.Действие  = "ЗаполнитьНаКлиенте";
	КомандаЗаполнения.Заголовок = "Заполнить";
	
	ЭлементПанель = Элементы.СписокСотрудниковКоманднаяПанель; 
	НоваяКнопка = Элементы.Добавить("КнопкаЗаполнить", Тип("КнопкаФормы"), ЭлементПанель);
	НоваяКнопка.ИмяКоманды = ИмяКоманды;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьНаКлиенте(Команда) Экспорт
	ЗаполнитьНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Объект.НачисленияПремий.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	BKM_Сотрудники.Ссылка КАК Сотрудник
	|ИЗ
	|	Справочник.BKM_Сотрудники КАК BKM_Сотрудники
	|ГДЕ
	|	НЕ BKM_Сотрудники.ПометкаУдаления
	|	И НЕ BKM_Сотрудники.Наименование ПОДОБНО ""%Не указан%""
	|	И НЕ BKM_Сотрудники.Наименование ПОДОБНО ""%Сервер%""
	|	И НЕ BKM_Сотрудники.Наименование = """"";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.НачисленияПремий.Добавить();
		НоваяСтрока.Сотрудник = Выборка.Сотрудник;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти