#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура МассовоеСозданиеДокументов(Период)Экспорт
	
	НачалоПериода = НачалоМесяца(Период);
	КонецПериода  = КонецМесяца(Период);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Договоры.Ссылка КАК Договор,
		|	Договоры.Владелец КАК Контрагент,
		|	Договоры.Организация КАК Организация,
		|	ЕСТЬNULL(Реализации.Ссылка, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК СуществующаяРеализация
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК Договоры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реализации
		|		ПО Договоры.Ссылка = Реализации.Договор
		|		И Реализации.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|		И НЕ Реализации.ПометкаУдаления
		|ГДЕ
		|	НЕ Договоры.ПометкаУдаления
		|	И Договоры.ВидДоговора = &ВидДоговора
		|	И Договоры.ВКМ_ДатаНачалаДействия <= &КонецПериода
		|	И (Договоры.ВКМ_ДатаОкончанияДействия >= &НачалоПериода
		|	ИЛИ Договоры.ВКМ_ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1))";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Всего = Выборка.Количество();
	Счетчик = 0;
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.СуществующаяРеализация) Тогда
			ДокументОбъект = Выборка.СуществующаяРеализация.ПолучитьОбъект();
		Иначе
			ДокументОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			ДокументОбъект.Дата = КонецПериода;
			ДокументОбъект.Организация = Выборка.Организация;
			ДокументОбъект.Контрагент = Выборка.Контрагент;
			ДокументОбъект.Договор = Выборка.Договор;
			ДокументОбъект.Комментарий = "Создано автоматически";
		КонецЕсли;

		ДокументОбъект.Ответственный = Пользователи.ТекущийПользователь();
		
		ДокументОбъект.BKM_ВыполнитьАвтозаполнение();
		
		Если ДокументОбъект.Услуги.Количество() > 0 Тогда
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		ИначеЕсли ЗначениеЗаполнено(Выборка.СуществующаяРеализация) Тогда
			ДокументОбъект.УстановитьПометкуУдаления(Истина);
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
		ДлительныеОперации.СообщитьПрогресс(Счетчик/Всего * 100);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли