
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	// Добавление ВКМ_ГруппаСрокДоговора		
	
		ВКМ_ГруппаСрокДоговора = Элементы.Вставить("ВКМ_ГруппаСрокДоговора", Тип("ГруппаФормы"), ЭтотОбъект, );
		ВКМ_ГруппаСрокДоговора.Вид = ВидГруппыФормы.ОбычнаяГруппа;

		Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
			ВКМ_ГруппаСрокДоговора.Видимость = Истина;
		Иначе
			ВКМ_ГруппаСрокДоговора.Видимость = Ложь;
		КонецЕсли;	
		
		// Добавление поля ВКМ_ДатаНачалаДействия
		ВКМ_ДатаНачалаДействия = Элементы.Вставить("ВКМ_ДатаНачалаДействия", Тип("ПолеФормы"), 
			Элементы.ВКМ_ГруппаСрокДоговора, );
		ВКМ_ДатаНачалаДействия.Вид = ВидПоляФормы.ПолеВвода;
		ВКМ_ДатаНачалаДействия.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействия";
		
		// Добавление поля ВКМ_ДатаОкончанияДействия
		ВКМ_ДатаОкончанияДействия = Элементы.Вставить("ВКМ_ДатаОкончанияДействия", Тип("ПолеФормы"),
			Элементы.ВКМ_ГруппаСрокДоговора, );
		ВКМ_ДатаОкончанияДействия.Вид = ВидПоляФормы.ПолеВвода;
		ВКМ_ДатаОкончанияДействия.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействия";
	
	// Добавление поля ВКМ_АбонентскаяПлата
	
		ВКМ_СуммаАбонентскойПлаты = Элементы.Вставить("ВКМ_АбонентскаяПлата", Тип("ПолеФормы"), , );
		ВКМ_СуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
		ВКМ_СуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";

		Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
			ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
		Иначе
			ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
		КонецЕсли;
	 
	// Добавление поля ВМК_СтоимостьЧасаРаботы
	
		ВМК_СтоимостьЧасаРаботы = Элементы.Вставить("ВМК_СтоимостьЧасаРаботы", Тип("ПолеФормы"), , );
		ВМК_СтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;
		ВМК_СтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВМК_СтоимостьЧасаРаботы";

		Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
			ВМК_СтоимостьЧасаРаботы.Видимость = Истина;
		Иначе
			ВМК_СтоимостьЧасаРаботы.Видимость = Ложь;
		КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)

	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		Элементы.ВКМ_ГруппаСрокДоговора.Видимость = Истина;
		Элементы.ВКМ_АбонентскаяПлата.Видимость = Истина;
		Элементы.ВМК_СтоимостьЧасаРаботы.Видимость = Истина;
	Иначе
		Элементы.ВКМ_ГруппаСрокДоговора.Видимость = Ложь;
		Элементы.ВКМ_АбонентскаяПлата.Видимость = Ложь;
		Элементы.ВМК_СтоимостьЧасаРаботы.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
