#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяКоманды = "Заполнить";
	КомандаЗаполнения = Команды.Добавить(ИмяКоманды);
	КомандаЗаполнения.Действие  = "ЗаполнитьНаКлиенте";
	КомандаЗаполнения.Заголовок = "Заполнить";
	
	ЭлементПанель = Элементы.НачисленияЗПКоманднаяПанель; 
	НоваяКнопка = Элементы.Добавить("КнопкаЗаполнить", Тип("КнопкаФормы"), ЭлементПанель);
	НоваяКнопка.ИмяКоманды = ИмяКоманды;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНачисленияЗП
&НаКлиенте
Процедура НачисленияЗПВидРасчетаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	МассивРазрешенных = Новый Массив;
	МассивРазрешенных.Добавить(ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ОсновныеНачисления.Оклад"));
	МассивРазрешенных.Добавить(ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск"));
	МассивРазрешенных.Добавить(ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ДополнительныеНачисления.ПремияПроцентом"));
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", МассивРазрешенных);
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(НовыйПараметр);
	
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьНаКлиенте(Команда) Экспорт
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Объект.НачисленияЗП.Очистить();
	
	НачалоПериода = НачалоМесяца(Объект.ПериодРегистрации);
	КонецПериода = КонецМесяца(Объект.ПериодРегистрации);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	BKM_Сотрудники.Ссылка КАК Сотрудник,
		|	ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.Оклад) КАК ВидРасчета
		|ИЗ
		|	Справочник.BKM_Сотрудники КАК BKM_Сотрудники
		|ГДЕ
		|	НЕ BKM_Сотрудники.ПометкаУдаления
		|	И НЕ BKM_Сотрудники.Наименование ПОДОБНО ""%Не указан%""
		|	И НЕ BKM_Сотрудники.Наименование ПОДОБНО ""%Сервер%""
		|	И НЕ BKM_Сотрудники.Наименование = """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник,
		|	ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ДополнительныеНачисления.ПремияПроцентом)
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты";

	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОсновнойГрафик = Справочники.ВКМ_ГрафикиРабот.НайтиПоНаименованию("5-2");
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Объект.НачисленияЗП.Добавить();
		НоваяСтрока.Сотрудник = Выборка.Сотрудник;
		НоваяСтрока.ВидРасчета = Выборка.ВидРасчета;
		
		Если Выборка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад 
			ИЛИ Выборка.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПремияПроцентом Тогда
			НоваяСтрока.ГрафикРабот = ОсновнойГрафик;
		КонецЕсли;

		НоваяСтрока.ДатаНачала = НачалоПериода;
		НоваяСтрока.ДатаОкончания = КонецПериода;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

