#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс	
	
// Функция добавляет уведомления в ТелеграммБот
// Параметры:
// ТекстСообщения - Строка
// Возвращаемое значение:
// Строка - НовоеУведомлени 
Функция ДобавитьУведомление(ТекстСообщения) Экспорт
	
		НовоеУведомление = СоздатьЭлемент();
		НовоеУведомление.ВКМ_ТекстСообщения = ТекстСообщения; 
		
		Попытка 
			
			НовоеУведомление.Записать(); 
			Возврат НовоеУведомление;
			
		Исключение
			
			Возврат Неопределено;
			
		КонецПопытки;
		
		
	КонецФункции
	
#КонецОбласти
	
#КонецЕсли